{
  "_id": "67b9bdbe599a10e745636030",
  "userEmail": "check123@gmail.com",
  "userName": "check123",
  "dateOfCreation": "2024-09-15T10:30:45.372Z",
  "dreams": [
    {
      "_id": "67b9c015599a10e77698606a",
      "dreamTitle": "Endless Staircase",
      "dreamDesc": "I was walking up a staircase that never ended. Each time I reached a landing, the steps twisted and changed direction. Strange whispers echoed around me, but no one was there. I felt an odd sense of urgency as if I was searching for something important but couldn’t remember what it was. The air felt heavy, making each step harder.",
      "dreamEmotion": "confusion",
      "dateLogged": "2024-12-10T14:45:30.000Z"
    },
    {
      "_id": "67b9c016599a10e77698606b",
      "dreamTitle": "Mystical Forest",
      "dreamDesc": "I wandered through a glowing forest where the trees pulsed with blue light. The air smelled like fresh rain, and strange symbols floated around me. I could hear voices humming a soft tune, guiding me toward a hidden cave. Inside, a golden owl sat on a pedestal, watching me closely. The moment I touched it, everything around me disappeared.",
      "dreamEmotion": "curiosity",
      "dateLogged": "2024-11-25T08:20:15.000Z"
    },
    {
      "_id": "67b9c017599a10e77698606c",
      "dreamTitle": "Flying Over the City",
      "dreamDesc": "I was effortlessly soaring above a futuristic city, my arms outstretched like wings. Below, neon lights reflected off glass buildings, and holographic billboards displayed messages in an unknown language. I tried to land, but the ground would push me back up. The sky felt infinite, and for a moment, I believed I could fly forever without ever needing to land.",
      "dreamEmotion": "empowerment",
      "dateLogged": "2024-10-30T21:10:05.000Z"
    },
    {
      "_id": "67b9c018599a10e77698606d",
      "dreamTitle": "Time Travel Adventure",
      "dreamDesc": "I stepped through a glowing doorway and found myself in an ancient civilization. People dressed in elaborate robes spoke in a language I didn’t understand. A merchant handed me a small artifact, and suddenly, the world shifted around me. I was in the future now, staring at floating cars and towering skyscrapers. Time was slipping between my fingers like sand.",
      "dreamEmotion": "curiosity",
      "dateLogged": "2024-12-01T12:05:55.000Z"
    },
    {
      "_id": "67b9c019599a10e77698606e",
      "dreamTitle": "Underwater Kingdom",
      "dreamDesc": "I found myself breathing underwater, surrounded by shimmering coral and glowing fish. A giant castle stood in the distance, its gates open as if inviting me inside. As I swam closer, I noticed figures with golden eyes watching me. One of them approached and spoke, their voice echoing inside my head. I was part of their world, and I belonged.",
      "dreamEmotion": "wonder",
      "dateLogged": "2024-09-18T05:40:00.000Z"
    },
    {
      "_id": "67b9c01a599a10e77698606f",
      "dreamTitle": "Talking to Animals",
      "dreamDesc": "I was sitting in a field, and suddenly, the animals around me started speaking. A wise old turtle told me stories of the past, while a rabbit shared secrets about the universe. Every creature had a voice, and they all had something important to say. It felt so real, as if I had unlocked a hidden ability that was always there.",
      "dreamEmotion": "joy",
      "dateLogged": "2024-10-05T17:30:10.000Z"
    },
    {
      "_id": "67b9c01b599a10e776986070",
      "dreamTitle": "Endless Library",
      "dreamDesc": "I was in a library with books stacked higher than I could see. Every book contained a different version of my life—some familiar, others completely strange. When I opened a book, I was sucked into its story, living the events as if they were real. The librarian, an old man with silver eyes, told me I could stay forever.",
      "dreamEmotion": "curiosity",
      "dateLogged": "2024-11-12T09:15:45.000Z"
    },
    {
      "_id": "67b9c01c599a10e776986071",
      "dreamTitle": "Chasing Shadows",
      "dreamDesc": "I was running through an abandoned city, chased by shifting shadows. No matter how fast I ran, they stayed just behind me. When I finally stopped and turned around, I saw my own reflection in their eyes. They whispered my name, and suddenly, I felt like I had known them all my life. I wasn’t afraid anymore. I understood.",
      "dreamEmotion": "fear",
      "dateLogged": "2024-12-14T22:05:20.000Z"
    },
    {
      "_id": "67b9c01d599a10e776986072",
      "dreamTitle": "Living Inside a Painting",
      "dreamDesc": "I stepped into a painting, and suddenly, I was inside a world made of swirling colors. The sky was a shifting canvas, and the ground felt like wet paint beneath my feet. Every brushstroke changed reality, and I could shape the world by drawing in the air. It felt like I had become part of an artist’s dream, forever changing.",
      "dreamEmotion": "creativity",
      "dateLogged": "2024-10-22T11:50:35.000Z"
    },
    {
      "_id": "67b9c01e599a10e776986073",
      "dreamTitle": "Reuniting with a Lost Friend",
      "dreamDesc": "I was walking through an empty street when I saw a familiar face. It was a friend I hadn’t seen in years, but they looked exactly the same. We talked for hours, laughing about old memories. Everything felt so real, until I realized I couldn’t remember how I got there. As I reached out to touch them, they faded away.",
      "dreamEmotion": "nostalgia",
      "dateLogged": "2024-09-28T03:55:10.000Z"
    }
  ]
}
